#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/OpenShift/aro-terra-gitaction/runs/run-wikdopjCr8vFLvAR

Waiting for the plan to start...

Terraform v1.4.5
on linux_amd64
Initializing plugins and modules...
random_string.resource_prefix: Refreshing state... [id=uretat]
data.azurerm_resource_group.resource_group: Refreshing...
data.azurerm_client_config.current: Refreshing...
azurerm_virtual_network.virtual_network: Refreshing state... [id=/subscriptions/86242313-4f69-4cf2-8ece-e45189dabe4e/resourceGroups/aro-openshit-dev-cac-001-RG/providers/Microsoft.Network/virtualNetworks/aro-openshit-dev-cac-001VNet]
data.azurerm_client_config.current: Refresh complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD02YWU2YWM0Mi04N2VkLTQxODktYmFiMS00Nzk4YjA2N2Y0NjE7b2JqZWN0SWQ9Njg4ZDkxNTEtMGRiMi00YmNkLTljOGQtZWNjZTUxMTIzOTgyO3N1YnNjcmlwdGlvbklkPTg2MjQyMzEzLTRmNjktNGNmMi04ZWNlLWU0NTE4OWRhYmU0ZTt0ZW5hbnRJZD1iNTM3YjY4Zi1kZDg0LTQ0NzEtODRmMi00MTRhZDRhMjhhODk=]
data.azurerm_resource_group.resource_group: Refresh complete after 0s [id=/subscriptions/86242313-4f69-4cf2-8ece-e45189dabe4e/resourceGroups/aro-openshit-dev-cac-001-RG]
azurerm_role_assignment.aro_cluster_service_principal_network_contributor: Refreshing state... [id=/subscriptions/86242313-4f69-4cf2-8ece-e45189dabe4e/resourceGroups/aro-openshit-dev-cac-001-RG/providers/Microsoft.Network/virtualNetworks/aro-openshit-dev-cac-001VNet/providers/Microsoft.Authorization/roleAssignments/5ae4fb08-bea6-39fa-734a-5980ab9b8a31]
azurerm_role_assignment.aro_resource_provider_service_principal_network_contributor: Refreshing state... [id=/subscriptions/86242313-4f69-4cf2-8ece-e45189dabe4e/resourceGroups/aro-openshit-dev-cac-001-RG/providers/Microsoft.Network/virtualNetworks/aro-openshit-dev-cac-001VNet/providers/Microsoft.Authorization/roleAssignments/8d20305c-ddcf-b860-90fc-2ec43cd053a9]
azurerm_subnet.worker_subnet: Refreshing state... [id=/subscriptions/86242313-4f69-4cf2-8ece-e45189dabe4e/resourceGroups/aro-openshit-dev-cac-001-RG/providers/Microsoft.Network/virtualNetworks/aro-openshit-dev-cac-001VNet/subnets/worker-subnet]
azurerm_subnet.master_subnet: Refreshing state... [id=/subscriptions/86242313-4f69-4cf2-8ece-e45189dabe4e/resourceGroups/aro-openshit-dev-cac-001-RG/providers/Microsoft.Network/virtualNetworks/aro-openshit-dev-cac-001VNet/subnets/master-subnet]
azurerm_virtual_network.virtual_network: Drift detected (delete)
azurerm_role_assignment.aro_cluster_service_principal_network_contributor: Drift detected (delete)
azurerm_role_assignment.aro_resource_provider_service_principal_network_contributor: Drift detected (delete)
azurerm_subnet.master_subnet: Drift detected (delete)
azurerm_subnet.worker_subnet: Drift detected (delete)

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # azurerm_subnet.master_subnet has been deleted
  - resource "azurerm_subnet" "master_subnet" {
      - id                                             = "/subscriptions/86242313-4f69-4cf2-8ece-e45189dabe4e/resourceGroups/aro-openshit-dev-cac-001-RG/providers/Microsoft.Network/virtualNetworks/aro-openshit-dev-cac-001VNet/subnets/master-subnet" -> null
        name                                           = "master-subnet"
        # (8 unchanged attributes hidden)
    }

  # azurerm_subnet.worker_subnet has been deleted
  - resource "azurerm_subnet" "worker_subnet" {
      - id                                             = "/subscriptions/86242313-4f69-4cf2-8ece-e45189dabe4e/resourceGroups/aro-openshit-dev-cac-001-RG/providers/Microsoft.Network/virtualNetworks/aro-openshit-dev-cac-001VNet/subnets/worker-subnet" -> null
        name                                           = "worker-subnet"
        # (8 unchanged attributes hidden)
    }

  # azurerm_virtual_network.virtual_network has been deleted
  - resource "azurerm_virtual_network" "virtual_network" {
      - id                      = "/subscriptions/86242313-4f69-4cf2-8ece-e45189dabe4e/resourceGroups/aro-openshit-dev-cac-001-RG/providers/Microsoft.Network/virtualNetworks/aro-openshit-dev-cac-001VNet" -> null
      - name                    = "aro-openshit-dev-cac-001VNet" -> null
        tags                    = {
            "createdWith" = "Terraform"
            "department"  = "Ops"
            "environment" = "Development"
        }
        # (7 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azapi_resource.aro_cluster will be created
  + resource "azapi_resource" "aro_cluster" {
      + body                      = (sensitive value)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "canadacentral"
      + name                      = "aro-openshit-dev-cac-001Aro"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/86242313-4f69-4cf2-8ece-e45189dabe4e/resourceGroups/aro-openshit-dev-cac-001-RG"
      + removing_special_chars    = false
      + schema_validation_enabled = true
      + tags                      = {
          + "createdWith" = "Terraform"
          + "department"  = "Ops"
          + "environment" = "Development"
        }
      + type                      = "Microsoft.RedHatOpenShift/openShiftClusters@2022-04-01"
    }

  # azurerm_role_assignment.aro_cluster_service_principal_network_contributor will be created
  + resource "azurerm_role_assignment" "aro_cluster_service_principal_network_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_role_assignment.aro_resource_provider_service_principal_network_contributor will be created
  + resource "azurerm_role_assignment" "aro_resource_provider_service_principal_network_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = (sensitive value)
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = true
    }

  # azurerm_subnet.master_subnet will be created
  + resource "azurerm_subnet" "master_subnet" {
      + address_prefixes                               = [
          + "10.0.0.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "master-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = false
      + resource_group_name                            = "aro-openshit-dev-cac-001-RG"
      + service_endpoints                              = [
          + "Microsoft.ContainerRegistry",
        ]
      + virtual_network_name                           = "aro-openshit-dev-cac-001VNet"
    }

  # azurerm_subnet.worker_subnet will be created
  + resource "azurerm_subnet" "worker_subnet" {
      + address_prefixes                               = [
          + "10.0.2.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "worker-subnet"
      + private_endpoint_network_policies_enabled      = (known after apply)
      + private_link_service_network_policies_enabled  = (known after apply)
      + resource_group_name                            = "aro-openshit-dev-cac-001-RG"
      + service_endpoints                              = [
          + "Microsoft.ContainerRegistry",
        ]
      + virtual_network_name                           = "aro-openshit-dev-cac-001VNet"
    }

  # azurerm_virtual_network.virtual_network will be created
  + resource "azurerm_virtual_network" "virtual_network" {
      + address_space       = [
          + "10.0.0.0/22",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "canadacentral"
      + name                = "aro-openshit-dev-cac-001VNet"
      + resource_group_name = "aro-openshit-dev-cac-001-RG"
      + subnet              = (known after apply)
      + tags                = {
          + "createdWith" = "Terraform"
          + "department"  = "Ops"
          + "environment" = "Development"
        }
    }

Plan: 6 to add, 0 to change, 0 to destroy.

```

</details>

*Pushed by: @DexHat, Action: `pull_request`*